package com.weixinpay.test;

public class Data {

	public static String CXJL="{                                                     "+
								"  \"reason\": \"success\",                          "+
								"  \"result\": {                                     "+
								"    \"summaryData\": {                              "+
								"      \"claimMoney\": 157981,                       "+
								"      \"repairMoney\": 45000,                       "+
								"      \"claimCount\": 1,                            "+
								"      \"repairCount\": 2,                           "+
								"      \"renewCount\": 4,                            "+
								"      \"renewMoney\": 112981                        "+
								"    },                                              "+
								"    \"carClaimRecords\": [                          "+
								"      {                                             "+
								"        \"claimDetails\": [                         "+
								"          {                                         "+
								"            \"itemName\": \"钣金:更换左后视镜底座\",       "+
								"            \"itemType\": \"维修\",                  "+
								"            \"itemAmount\": \"30000\"               "+
								"          },                                        "+
								"          {                                         "+
								"            \"itemName\": \"钣金:左后视镜壳油漆\",        "+
								"            \"itemType\": \"维修\",                  "+
								"            \"itemAmount\": \"15000\"               "+
								"          },                                        "+
								"          {                                         "+
								"            \"itemName\": \"倒车镜固定座（左）\",         "+
								"            \"itemType\": \"换件\",                  "+
								"            \"itemAmount\": \"74663\"               "+
								"          },                                        "+
								"          {                                         "+
								"            \"itemName\": \"倒车镜转向灯（左）\",         "+
								"            \"itemType\": \"换件\",                  "+
								"            \"itemAmount\": \"14480\"               "+
								"          },                                        "+
								"          {                                         "+
								"            \"itemName\": \"倒车镜片（左）\",            "+
								"            \"itemType\": \"换件\",                  "+
								"            \"itemAmount\": \"12313\"               "+
								"          },                                        "+
								"          {                                         "+
								"            \"itemName\": \"倒车镜壳（左）\",            "+
								"            \"itemType\": \"换件\",                  "+
								"            \"itemAmount\": \"11525\"               "+
								"          }                                         "+
								"        ],                                          "+
								"        \"licenseNo\": \"浙A9LE90\",                 "+
								"        \"otherAmount\": \"0\",                     "+
								"        \"repairAmount\": \"45000\",                "+
								"        \"renewalAmount\": \"112981\",              "+
								"        \"dangerTime\": \"2015-03-05 00:00:00\",    "+
								"        \"damageMoney\": \"157981\"                 "+
								"      }                                             "+
								"    ]                                               "+
								"  },                                                "+
								"  \"error_code\": 0                                 "+
								"}                                                   ";
	public static String TBXX = "{                                                        "+
			"  \"reason\": \"success\",                               "+
			"  \"result\": {                                          "+
			"    \"UserInfo\": {                                      "+
			"      \"CarUsedType\": 1,                                "+
			"      \"LicenseNo\": \"粤S788MA\",                       "+
			"      \"LicenseOwner\": \"郭胜忠\",                      "+
			"      \"InsuredName\": \"郭胜忠\",                       "+
			"      \"PostedName\": \"郭胜忠\",                        "+
			"      \"IdType\": 1,                                     "+
			"      \"CredentislasNum\": \"350583198111287417\",       "+
			"      \"CityCode\": 17,                                  "+
			"      \"EngineNo\": \"0916376306DT\",                    "+
			"      \"ModleName\": \"揽胜RANGE ROVER 3.0TD越野车\",    "+
			"      \"CarVin\": \"SALGA2KF4FA228734\",                 "+
			"      \"RegisterDate\": \"2015-10-10\",                  "+
			"      \"ForceExpireDate\": \"2017-10-10 23:59:59\",      "+
			"      \"BusinessExpireDate\": \"2017-10-10 23:59:59\",   "+
			"      \"NextForceStartDate\": \"2017-10-11 00:00:00\",   "+
			"      \"NextBusinessStartDate\": \"2017-10-11 00:00:00\","+
			"      \"PurchasePrice\": 1338000,                        "+
			"      \"SeatCount\": 5,                                  "+
			"      \"FuelType\": 1,                                   "+
			"      \"ProofType\": 1,                                  "+
			"      \"LicenseColor\": 1,                               "+
			"      \"ClauseType\": 2,                                 "+
			"      \"RunRegion\": 1,                                  "+
			"      \"InsuredIdCard\": \"350583198111287417\",         "+
			"      \"InsuredIdType\": 1,                              "+
			"      \"InsuredMobile\": \"\",                           "+
			"      \"HolderIdCard\": \"350583198111287417\",          "+
			"      \"HolderIdType\": 1,                               "+
			"      \"HolderMobile\": \"\",                            "+
			"      \"RateFactor1\": 0.85,                             "+
			"      \"RateFactor2\": 0.85,                             "+
			"      \"RateFactor3\": 0.85,                             "+
			"      \"RateFactor4\": 0,                                "+
			"      \"IsPublic\": 2,                                   "+
			"      \"BizNo\": \"PDAA201644190000356818\",             "+
			"      \"ForceNo\": \"PDZA201644190000366294\",           "+
			"      \"ExhaustScale\": \"2.9930\",                      "+
			"      \"AutoMoldCode\": \"LHBAEI0053\"                   "+
			"    },                                                   "+
			"    \"SaveQuote\": {                                     "+
			"      \"Source\": 4,                                     "+
			"      \"CheSun\": 1241664,                               "+
			"      \"SanZhe\": 2000000,                               "+
			"      \"DaoQiang\": 1241664,                             "+
			"      \"SiJi\": 10000,                                   "+
			"      \"ChengKe\": 10000,                                "+
			"      \"BoLi\": 2,                                       "+
			"      \"HuaHen\": 10000,                                 "+
			"      \"SheShui\": 1,                                    "+
			"      \"ZiRan\": 1241664,                                "+
			"      \"BuJiMianCheSun\": 1,                             "+
			"      \"BuJiMianSanZhe\": 1,                             "+
			"      \"BuJiMianDaoQiang\": 1,                           "+
			"      \"BuJiMianChengKe\": 1,                            "+
			"      \"BuJiMianSiJi\": 1,                               "+
			"      \"BuJiMianHuaHen\": 1,                             "+
			"      \"BuJiMianSheShui\": 1,                            "+
			"      \"BuJiMianZiRan\": 1,                              "+
			"      \"BuJiMianJingShenSunShi\": 0,                     "+
			"      \"HcSanFangTeYue\": 0,                             "+
			"      \"HcJingShenSunShi\": 0,                           "+
			"      \"HcXiuLiChang\": \"0\",                           "+
			"      \"HcXiuLiChangType\": \"-1\",                      "+
			"      \"Fybc\": \"0\",                                   "+
			"      \"FybcDays\": \"0\",                               "+
			"      \"SheBeiSunShi\": \"0\",                           "+
			"      \"BjmSheBeiSunShi\": \"0\",                        "+
			"      \"SheBeis\": [                                     "+
			"                                                         "+
			"      ]                                                  "+
			"    },                                                   "+
			"    \"BusinessStatus\": 1,                               "+
			"    \"StatusMessage\": \"续保成功\"                         "+
			"  },                                                     "+
			"  \"error_code\": 0                                      "+
			"}                                                        ";
	public static String CLZT = "{                                    "+
			"  \"reason\": \"success\",                  "+
			"  \"result\": {                             "+
			"    \"engine\": \"AA*****89\",              "+
			"    \"state\": \"G\",                       "+
			"    \"plate\": \"BP***T\",                  "+
			"    \"pps\": \"2013-08-15 00:00:00\",       "+
			"    \"number\": \"37020*****1447\",         "+
			"    \"properties\": \"A\",                  "+
			"    \"type\": \"SQR7*****2T0\",             "+
			"    \"variety\": \"02\",                    "+
			"    \"engineType\": \"SQR******\",          "+
			"    \"record\": \"null\",                   "+
			"    \"passengers\": \"5\",                  "+
			"    \"retirement\": \"2099-12-31 00:00:00\","+
			"    \"color\": \"B\",                       "+
			"    \"validity\": \"2017-10-31 00:00:00\",  "+
			"    \"vin\": \"LVVDC*********999\",         "+
			"    \"fuel\": \"A\",                        "+
			"    \"brand\": \"奇瑞牌\",                  "+
			"    \"vehicleType\": \"K33\",               "+
			"    \"cc\": \"1598\",                       "+
			"    \"man\": \"尹**\"                       "+
			"  },                                        "+
			"  \"error_code\": 0                         "+
			"}                                           ";
	public static String BYJL = "{\"reason\":\"success\","
			+ "\"result\":{"
			+ "\"order_id\":\"975144001505101775\","
			+ "\"notify_time\":\"2017-09-11 11:52\","
			+ "\"total_mileage\":106520,"
			+ "\"number_of_accidents\":5,"
			+ "\"car_brand\":\"凯迪拉克\","
			+ "\"result_status\":\"QUERY_SUCCESS\","
			+ "\"result_content\":["
				+ "{\"content\":\"保养Ⅰ(除底盘保养）;\",\"date\":\"2014-05-03\",\"materal\":\";油液滤清器总成:1;发动机机油(1升,美孚):2;发动机机油(4升,美孚):1;\",\"mileage\":8107,\"remark\":\"更换机油与机滤;保养;\"},"
				+ "{\"content\":\"发动机清洗保护剂;\",\"date\":\"2014-05-03\",\"materal\":\";燃油系统清洁器,薄膜加上20盎司 ERI:1;发动机机油清洗剂:2;\",\"mileage\":8107,\"remark\":\"发动机清洗保护剂;保养;\"},"
				+ "{\"content\":\"保养Ⅰ(除底盘保养）;\",\"date\":\"2014-07-20\",\"materal\":\";油液滤清器总成:1;发动机机油(1升,美孚):2;发动机机油(4升,美孚):1;\",\"mileage\":18600,\"remark\":\"更换机油与机滤;保养;\"},"
				+ "{\"content\":\"发动机清洗保护;\",\"date\":\"2014-07-20\",\"materal\":\";燃油系统清洁器,薄膜加上20盎司 ERI:1;发动机机油清洗剂:2;\",\"mileage\":18600,\"remark\":\"发动机清洗保护;发动机清洗保护;\"},"
				+ "{\"content\":\"更换机油机滤;\",\"date\":\"2014-10-17\",\"materal\":\";油液滤清器总成:1;发动机机油(美孚,1升-DEXOS 1):2;发动机机油(美孚,4升-DEXOS 1):1;\",\"mileage\":29202,\"remark\":\"保养;3万公里保养;\"},"
				+ "{\"content\":\"后悬架召回;\",\"date\":\"2014-10-17\",\"materal\":null,\"mileage\":29202,\"remark\":\"SRX 后悬架调节连杆的检查与紧固-双侧;SRX 后悬架调节连杆的检查与紧固-双侧;\"},"
				+ "{\"content\":\"发动机清洗保护;\",\"date\":\"2014-10-17\",\"materal\":\";发动机机油清洗剂:2;\",\"mileage\":29202,\"remark\":\"一般维修;发动机清洗保护;\"},"
				+ "{\"content\":\"调整前保险杠总成;修复前杠下段;前保险杠皮_前保险杠皮上色亮漆;左前叶喷漆;\",\"date\":\"2014-11-11\",\"materal\":\";日行灯:1;前保险杠蒙皮侧托架:1;\",\"mileage\":31609,\"remark\":\"事故;事故维修;保险;保险;前部维修;前部受损;事故;事故;\"},"
				+ "{\"content\":\"更换安全带卡扣;\",\"date\":\"2014-12-02\",\"materal\":\";乘客座椅安全带维修包（插扣侧） *页岩色:1;\",\"mileage\":33557,\"remark\":\"安全带卡扣扣不住;安全带卡扣扣不住;\"},"
				+ "{\"content\":\"更换机油及机滤;常规四件套;\",\"date\":\"2015-01-16\",\"materal\":\";油液滤清器总成:1;发动机机油(嘉实多,1升-DEXOS 1):2;发动机机油(嘉实多,4升-DEXOS 1):1;常规保养四件套:1;车安达护理油阀:1;机舱深层护理套装:3;\",\"mileage\":40085,\"remark\":\"保养;4万公里保养;\"},"
				+ "{\"content\":\"更换前刹车片;四轮定位;\",\"date\":\"2015-02-06\",\"materal\":\";前制动盘摩擦衬块维修包:1;\",\"mileage\":43316,\"remark\":\"前刹车片检查;检查;\"},{\"content\":\"更换喇叭;\",\"date\":\"2015-02-28\",\"materal\":\";喇叭总成-双音:1;\",\"mileage\":47861,\"remark\":\"喇叭单音;检查;\"},"
				+ "{\"content\":\"更换油箱盖执行器;\",\"date\":\"2015-02-28\",\"materal\":\";燃油箱加注管壳体总成:1;\",\"mileage\":47861,\"remark\":\"油箱盖关不紧;检查;\"},"
				+ "{\"content\":\"更换机油、机油滤;7项免费检测;\",\"date\":\"2015-04-02\",\"materal\":\";空气滤清器滤芯总成:1;油液滤清器总成:1;发动机机油(美孚,1升-DEXOS 1):2;发动机机油(美孚,4升-DEXOS 1):1;\",\"mileage\":51074,\"remark\":\"保养;50000公里定保;\"},"
				+ "{\"content\":\"更换左前轮内防尘罩;\",\"date\":\"2015-04-14\",\"materal\":\";前轮驱动轴三通万向节护罩组件:1;\",\"mileage\":52809,\"remark\":\"左前轮处会漏油;检查左前轮内防尘罩;\"},"
				+ "{\"content\":\"七大项免费检测;更换机油机油格;更换刹车油;清洗及保护发动机油道;更换方向机油;清洗油路赠添加剂;更换波箱油;更换两格;清洗节气门及编程;\",\"date\":\"2015-06-24\",\"materal\":\";乘客厢空气滤清器:1;制动液 16盎司 DOT 3:4;燃油滤清器总成:1;油液滤清器总成:1;节流阀清洗剂:1;燃油系统清洗套餐:6;自动变速器油 (DEXRON VI)(1升):2;自动变速器油 (DEXRON VI)(4升):3;燃油系统清洗套餐:1;发动机机油清洗剂:1;发动机机油(美孚,1升-DEXOS 1):2;发动机机油(美孚,4升-DEXOS 1):1;引擎内部专用保护剂:1;\",\"mileage\":62189,\"remark\":\"七大项免费检测;常规保养（银）;七大项免费检测;7500KM定期保养;刹车油脏;发动机油道脏;方向机油脏;油路脏;波箱油脏;空调格、汽油格脏;节气门脏;\"},"
				+ "{\"content\":\"燃油添加剂赠送֐¤;\",\"date\":\"2015-07-09\",\"materal\":\";燃油系统清洗套餐:3;\",\"mileage\":62889,\"remark\":\"燃油添加剂赠送;燃油添加剂赠送;\"},{\"content\":\"更换前挡;\",\"date\":\"2015-07-17\",\"materal\":\";风窗玻璃总成:1;玻璃氨基甲酸乙酯粘合剂维修包:2;\",\"mileage\":63641,\"remark\":\"更换前挡;更换前挡;\"},"
				+ "{\"content\":\"更换左前轮芯;\",\"date\":\"2015-10-07\",\"materal\":\";前轮轴承总成:1;\",\"mileage\":72541,\"remark\":\"行驶车子有异响;检查轮芯;\"},"
				+ "{\"content\":\"更换机油、机油滤;购买三次基础保养赠送一次基础保养;28项免费检测;\",\"date\":\"2015-10-07\",\"materal\":\";油液滤清器:1;发动机机油清洗剂:2;发动机机油(美孚,1升-DEXOS 1):2;发动机机油(美孚,4升-DEXOS 1):1;\",\"mileage\":72541,\"remark\":\"保养;嘉年华活动;定期保养;购买三次基础保养赠送一次基础保养;\"},"
				+ "{\"content\":\"更换右后轮轮芯;\",\"date\":\"2015-10-08\",\"materal\":\";前轮轴承总成:1;\",\"mileage\":72541,\"remark\":\"行驶异响;检查轮芯;\"},{\"content\":\"更换排气凸轮轴位置执行器;\",\"date\":\"2015-10-12\",\"materal\":\";凸轮轴位置执行器电磁阀总成:1;\",\"mileage\":73040,\"remark\":\"发动机故障灯亮;电脑检测;\"},"
				+ "{\"content\":\"保养Ⅰ(除底盘保养）;\",\"date\":\"2015-12-23\",\"materal\":\";油液滤清器:1;发动机机油(美孚,1升-DEXOS 1):2;发动机机油(美孚,4升-DEXOS 1):1;\",\"mileage\":80000,\"remark\":\"保养;买三送一80000KM保养;\"},{\"content\":\"第二次保养;\",\"date\":\"2016-02-20\",\"materal\":null,\"mileage\":80384,\"remark\":\"买三送一;第二次保养;\"},"
				+ "{\"content\":\"冬季活动送礼;\",\"date\":\"2016-02-24\",\"materal\":null,\"mileage\":80800,\"remark\":\"冬季活动送礼;冬季活动送礼;\"},{\"content\":\"更换进气凸轮轴电磁阀;\",\"date\":\"2016-03-19\",\"materal\":\";凸轮轴位置执行器电磁阀总成:1;\",\"mileage\":84838,\"remark\":\"发动机故障灯亮;进气凸轮轴电磁阀故障;\"},"
				+ "{\"content\":\"更换三格;清洗节气门及编程学习;\",\"date\":\"2016-03-19\",\"materal\":\";空气滤清器滤芯总成:1;燃油滤清器总成:1;节流阀清洗剂:1;<附件> 乘客舱空气滤清器总成:1;\",\"mileage\":84838,\"remark\":\"28项免费检查;28项免费检查;\"},{\"content\":\"更换机油机油格;\",\"date\":\"2016-05-15\",\"materal\":\";油液滤清器:1;发动机机油(美孚,1升-DEXOS 1):2;发动机机油(美孚,4升-DEXOS 1):1;\",\"mileage\":91649,\"remark\":\"保养;常规保养;\"},"
				+ "{\"content\":\"更换机油、机油滤;更换刹车油并排空气;更换方向机油;更换火花塞;7项免费检测;\",\"date\":\"2016-07-25\",\"materal\":\";〈高流失〉火花塞总成:6;<养护〉动力转向系统清洗剂:1;<养护〉动力转向保护剂:1;油液滤清器:1;动力转向液:1;〈高流失〉液压制动液(乙二醇)(1升):2;发动机机油(美孚,1升-DEXOS 1):2;发动机机油(美孚,4升-DEXOS 1):1;\",\"mileage\":102233,\"remark\":\"保养;车子提速慢，没什么力气;买三送一第三次保养;检查火花塞;\"},"
				+ "{\"content\":\"七项检查;四轮对调动平衡;\",\"date\":\"2016-08-02\",\"materal\":null,\"mileage\":105005,\"remark\":\"七项检查;七项检查;\"},{\"content\":\"更换左前半轴;更换左前方向机外球头;\",\"date\":\"2016-08-04\",\"materal\":\";转向连杆外拉杆球头维修包:1;前轮驱动轴总成:1;\",\"mileage\":105005,\"remark\":\"80KM时速车身抖;80KM时速车身抖;左前半轴响，晃动大;左前方向机外球头胶烂;\"},{\"content\":null,\"date\":\"2016-09-21\",\"materal\":null,\"mileage\":106520,\"remark\":null}"
			+ "],"
			+ "\"ext_info\":[],"
			+ "\"result_report\":[\"无水浸事故\",\"无火烧事故\",\"电气及安全设备或动力总成记录异常\",\"外观件及钣金件记录异常\",\"车身结构件记录正常\",\"里程表记录正常\"],"
			+ "\"last_time_to_shop\":\"2016-09-21\","
			+ "\"result_description\":["
				+ "{\"date\":\"2014-12-02\",\"content\":\"更换安全带卡扣;\"},"
				+ "{\"date\":\"2015-04-14\",\"content\":\"更换左前轮内防尘罩;\"},"
				+ "{\"date\":\"2016-08-04\",\"content\":\"更换左前半轴;更换左前方向机外球头;\"},"
				+ "{\"date\":\"2014-11-11\",\"content\":\"调整前保险杠总成;修复前杠下段;前保险杠皮前保险杠皮_前保险杠皮前保险杠皮上色亮漆;左前叶喷漆;\"},"
				+ "{\"date\":\"2015-07-17\",\"content\":\"更换前挡;\"}"
			+ "],"
			+ "\"vin\":\"3GYFN9E56ES574021\","
			+ "\"result_images\":\"\"},"
			+ "\"error_code\":0}";

	public static void main(String[] args) {
		System.out.println(CXJL.replaceAll("\\s+", " "));
	}

}
